#Begin - 5
print ("""            ===============
             V=a*a*a
            =================""")
a= int(input("Введите ребро куба: "))
V=a*a*a
print("Объема куба равен: "+str(V))
#Begin-6

print ("""            ===============
             V=a*b*c; S=2*(a*b+b*c+a*c)
            =================""")
a= int(input("Введите ребро параллелепипеда: "))
b= int(input("Введите ребро параллелепипеда:"))
c=int(input("Введите ребро параллелепипеда:"))
V=a*b*c
S=2*(a*b+b*c+a*c)
print("Объем параллелепипеда: "+ str(V))
print(" Площади поверхности:"+ str(S))


#Begin-7
print ("""            ===============
             L=2*PI*R; S=PI*R*R
            =================""")
R=int(input("Введите радиус окружности:"))
PI=3.14
L=2*PI*R
S=PI*R*R
print("Длина окружности: "+str(L))

print("Площадь круга: "+str(S))

#Begin-8
print ("""            ===============
             sredniy_arif=(a+b)/2
            =================""")
a=int(input("Введите число а: "))
b=int(input("Введите число b: "))
sredniy_arif=(a+b)/2
print("Средний арифметический значения двух число: "+str(sredniy_arif))


 

