#Begin-2
print("""          ================
              S=a*a
          ================""")
a= int(input(" Введите сторона квадрата: "))
S=a*a
print(" Площадь квадрата: " + str(S))

#Begin-3
print("""          ================
              S=a*b, P=2*(a+b)
          ================""")
a= int(input(" Введите длина прямоугольника:"))
b=int(input(" Введите ширина прямоугольника:"))

A=a*b
D=2*(a+b)
print(" Площадь прямоугольника: "+ str(A))
print("  Периметр прямоуголтника :"+ str(D))
#Begin-4

print("""          ================
               L=PI*d, PI=3.14
          ================""")
d=int(input("Введите диаметр окружность: "))
PI=3.14
L=PI*d
print ("Длина окружноста равен: "+str(L))
